## Import Dependencies

In [34]:
import pandas as pd

#engine = create_engine('postgresql://localhost:5432/')
#connection = engine.connect()

In [35]:
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, Float

In [36]:
# Base = automap_base()
# Base.prepare(engine, reflect=True)
# Base.classes.keys()
# session = Session(engine)

In [37]:
# Base = declarative_base()

### Extract CSVs into DataFrames

In [38]:
data = pd.read_csv('./athlete_events.csv')
country_info = pd.read_csv('./noc_regions.csv')
olympic_df = pd.merge(data, country_info, how="left", on = "NOC")
olympic_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,region,notes
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,China,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,China,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,Denmark,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,Denmark,NaN
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,Netherlands,NaN

In [39]:
olympic_info = olympic_df.drop(columns=['Name', 'Age', "Height", "Weight", "Games", "Season", "City", "Sport", "Event", "ID","notes"])

In [40]:
olympic_df = olympic_info.dropna()
olympic_df.reset_index(drop=True)

      Sex            Team  NOC  Year   Medal   region
0       M  Denmark/Sweden  DEN  1900    Gold  Denmark
1       M         Finland  FIN  1920  Bronze  Finland
2       M         Finland  FIN  1920  Bronze  Finland
3       M         Finland  FIN  2014  Bronze  Finland
4       M         Finland  FIN  1948  Bronze  Finland
...    ..             ...  ...   ...     ...      ...
39769   F    Soviet Union  URS  1956  Silver   Russia
39770   F    Soviet Union  URS  1964  Bronze   Russia
39771   M          Poland  POL  1980  Bronze   Poland
39772   F          Russia  RUS  2000  Bronze   Russia
39773   F          Russia  RUS  2004  Silver   Russia

[39774 rows x 6 columns]

In [41]:
# It looks like some of the teams aren't countries, so this is another difficulty to contend with
# Changed the grup by to "region" instead of team to get country name

#olympic_df.groupby("region").count().head(15)

In [42]:
# Total team names is more than total countries in country GDP dataset, where 176 countries are represented
# Number of countries is down to 136 
number_of_countries = olympic_df["region"].nunique()
number_of_countries

136

In [71]:
olympic_df["medal_won"] = (olympic_df["Medal"] != "NaN")
olympic_df.head()

   Sex            Team  NOC  Year   Medal  Country  medal_won
3    M  Denmark/Sweden  DEN  1900    Gold  Denmark       True
37   M         Finland  FIN  1920  Bronze  Finland       True
38   M         Finland  FIN  1920  Bronze  Finland       True
40   M         Finland  FIN  2014  Bronze  Finland       True
41   M         Finland  FIN  1948  Bronze  Finland       True

In [45]:
infile = pd.read_csv("Country_GDP.csv")
country_GDP = pd.DataFrame(infile)

In [46]:
country_GDP = country_GDP.sort_values(by = "Country").reset_index()
country_GDP.head()

   index            Country 1913    1950    1973    1990    1998
0      0        Afghanistan  NaN   5 255   9 181   8 861  12 744
1      1            Albania  NaN   1 228   5 219   8 125   7 999
2      2            Algeria  NaN  12 136  35 814  73 934  81 948
3      3             Angola  NaN   4 331  10 784   7 207   7 029
4      4  Antigua & Barbuda  NaN      82     328     413     510

In [27]:
# country_GDP = country_GDP.drop(columns = ['level_0', 'index', 'Unnamed: 1'])

In [47]:
infile = pd.read_csv("Country_population.csv")
country_pop = pd.DataFrame(infile)

In [48]:
country_pop.head()

   level_0  index            Country   1913   1950    1973    1990    1998
0        0      0        Afghanistan  5 730  8 150  13 421  14 767  24 792
1        1      1            Albania    898  1 227   2 318   3 273   3 331
2        2      2            Algeria    NaN  8 893  15 198  25 352  30 481
3        3      3             Angola    NaN  4 118   6 028   8 430  10 865
4        4      4  Antigua & Barbuda    NaN     46      68      63      64

In [70]:
# country_pop = country_pop.rename(columns = {'Unnamed: 0': "Country"}).sort_values(by = 'Country').reset_index()

In [50]:
country_pop.head()

   level_0  index            Country   1913   1950    1973    1990    1998
0        0      0        Afghanistan  5 730  8 150  13 421  14 767  24 792
1        1      1            Albania    898  1 227   2 318   3 273   3 331
2        2      2            Algeria    NaN  8 893  15 198  25 352  30 481
3        3      3             Angola    NaN  4 118   6 028   8 430  10 865
4        4      4  Antigua & Barbuda    NaN     46      68      63      64

In [21]:
# country_pop = country_pop.drop(columns = ['Unnamed: 1', 'index'])
# country_pop.head()

In [68]:
# country_pop = country_pop.sort_values(by = 'Country').reset_index()

In [52]:
country_pop.head()

   level_0  index            Country   1913   1950    1973    1990    1998
0        0      0        Afghanistan  5 730  8 150  13 421  14 767  24 792
1        1      1            Albania    898  1 227   2 318   3 273   3 331
2        2      2            Algeria    NaN  8 893  15 198  25 352  30 481
3        3      3             Angola    NaN  4 118   6 028   8 430  10 865
4        4      4  Antigua & Barbuda    NaN     46      68      63      64

In [53]:
country_pop.to_csv("Country_population.csv", index = False)

In [66]:
olympic_df["medal_won"] = (olympic_df["Medal"] == "Gold")
olympic_df["medal_won"].value_counts()

False    26403
True     13371
Name: medal_won, dtype: int64

## Transform DataFrame

In [56]:
# Rename column "region"
olympic_df = olympic_df.rename(columns = {"region":"Country"})
olympic_df.head()

   Sex            Team  NOC  Year   Medal  Country  medal_won
3    M  Denmark/Sweden  DEN  1900    Gold  Denmark       True
37   M         Finland  FIN  1920  Bronze  Finland      False
38   M         Finland  FIN  1920  Bronze  Finland      False
40   M         Finland  FIN  2014  Bronze  Finland      False
41   M         Finland  FIN  1948  Bronze  Finland      False

In [57]:
medals_df = olympic_df['Medal'].dropna(how = 'any')
medals_df.head()

3       Gold
37    Bronze
38    Bronze
40    Bronze
41    Bronze
Name: Medal, dtype: object

In [58]:
by_country = olympic_df.groupby("Country")
medal_count = by_country["Medal"].count()
medal_count

Country
Afghanistan              2
Algeria                 17
Argentina              274
Armenia                 16
Australia             1349
                      ...
Venezuela               15
Vietnam                  4
Virgin Islands, US       1
Zambia                   2
Zimbabwe                22
Name: Medal, Length: 136, dtype: int64

In [59]:
#medal_count.sum()
agg_olympic_df = pd.DataFrame({"Number of Medals Won": medal_count})


# Merge dataframes 
combined_df = pd.merge(agg_olympic_df, country_pop, how = "inner", on = "Country")
combined_df.head(15)

,Country,Number of Medals Won,level_0,index,1913,1950,1973,1990,1998
0,Afghanistan,2,0,0,5 730,8 150,13 421,14 767,24 792
1,Algeria,17,2,2,NaN,8 893,15 198,25 352,30 481
2,Argentina,274,5,5,7 653,17 150,25 174,32 634,36 265
3,Armenia,16,6,6,NaN,1 355,2 697,3 335,3 795
4,Australia,1349,7,7,4 821,8 177,13 505,17 085,18 751
5,Austria,450,8,8,6 767,6 935,7 586,7 729,8 078
6,Azerbaijan,44,9,9,NaN,2 900,5 468,7 134,7 666
7,Bahamas,40,10,10,NaN,70,182,251,180
8,Bahrain,3,11,11,104,115,239,502,616
9,Barbados,1,12,12,NaN,211,243,255,259
10,Belarus,139,13,13,NaN,7 755,9 235,10 260,10 239
11,Belgium,468,14,14,7 666,8 640,9 738,9 971,10 197
12,Bermuda,1,17,17,NaN,39,53,58,62
13,Botswana,1,20,20,NaN,430,643,1 304,1 448
14,Brazil,475,21,21,23 660,53 443,103 463,151 040,169 807

In [60]:
gold_medals = olympic_df[olympic_df["Medal"] == "Gold"]
gold_by_country = gold_medals.groupby("Country")

gold_medal_count = gold_by_country["Medal"].count()
agg_olympic_df2 = pd.DataFrame({"Number of Gold Medals Won": gold_medal_count})
agg_olympic_df2.head()

           Number of Gold Medals Won
Country
Algeria                            5
Argentina                         91
Armenia                            2
Australia                        368
Austria                          108

In [61]:
by_gender = olympic_df.groupby("Sex")
medals_won = by_gender["Medal"].count()
agg_olympic_df4 = pd.DataFrame({"Number of Medals Won": medals_won})
agg_olympic_df4 = agg_olympic_df4.reset_index()
agg_olympic_df4.head()

  Sex  Number of Medals Won
0   F                 11246
1   M                 28528

In [62]:
by_country = olympic_df.groupby(["Country", "Sex"])
medals_won = by_country["Medal"].count()
agg_olympic_df3 = pd.DataFrame({"Number of Medals Won": medals_won})
agg_olympic_df3 = agg_olympic_df3.reset_index()
agg_olympic_df3.head()

       Country Sex  Number of Medals Won
0  Afghanistan   M                     2
1      Algeria   F                     3
2      Algeria   M                    14
3    Argentina   F                    73
4    Argentina   M                   201

## Loading Data

In [63]:
db_path = "olympic_history_db"
engine = create_engine(f"sqlite:///{db_path}")
connect = engine.connect()

In [64]:
agg_olympic_df3.to_sql('medals_won_and_sex_by_country', con=engine, if_exists = 'replace')

In [65]:
agg_olympic_df4.to_sql('medals_won_and_sex', con=engine, if_exists = 'replace')